[
    {
        "id": "1",
        "name": "वैकुंठ एकादशी",
        "date": "2025-12-30",
        "fastStartTime": "06:35 AM",
        "fastBreakTime": "Dec 31, 06:36 AM - 10:25 AM",
        "description": "इसे पौष पुत्रदा एकादशी भी कहा जाता है। इस दिन वैकुंठ के द्वार खुलते हैं।",
        "story": "यद्यपि यह पौष पुत्रदा एकादशी है, इसे वैकुंठ एकादशी के रूप में मनाया जाता है क्योंकि यह पवित्र धनुर्मास में आती है। मान्यता है कि इस दिन वैकुंठ (भगवान का धाम) के द्वार खुलते हैं। भक्त जो मंदिरों में 'वैकुंठ द्वार' से गुजरते हैं, उन्हें मोक्ष प्राप्त होता है। ऐतिहासिक रूप से, राजा महीजित ने भी एक योग्य पुत्र प्राप्ति के लिए यह व्रत किया था।",
        "fastingRules": "सख्त व्रत: अनाज, बीन्स या चावल का सेवन न करें।\nध्यान: 'ओम नमो नारायणाय' का जप करें।\nगतिविधि: उत्तरी द्वार (परमपद वासल) से गुजरने के लिए सुबह जल्दी विष्णु मंदिर जाएं।",
        "benefits": "मोक्ष प्रदान करता है और आध्यात्मिक दुनिया के द्वार खोलता है। यह संतान और पारिवारिक कल्याण में आने वाली बाधाओं को भी दूर करता है।"
    },
    {
        "id": "2",
        "name": "षटतिला एकादशी",
        "date": "2026-01-14",
        "fastStartTime": "06:40 AM",
        "fastBreakTime": "Jan 15, 06:41 AM - 10:30 AM",
        "description": "तिल का दिन। दरिद्रता और दुर्भाग्य को दूर करता है।",
        "story": "एक बार एक अमीर महिला ने भिक्षा में भोजन के बजाय एक मुट्ठी मिट्टी दी। मृत्यु के बाद वह स्वर्ग गई लेकिन उसे खाली घर और भोजन नहीं मिला। उसने भगवान से प्रार्थना की, जिन्होंने उसे षटतिला एकादशी का पालन करने के लिए कहा। यह दिन दान के महत्व पर जोर देता है। 'षट-तिला' का अर्थ है तिल का छह तरीकों से उपयोग करना, जो शुद्धि और पोषण का प्रतीक है।",
        "fastingRules": "तिल के छह उपयोग: 1. तिल के पानी से स्नान करें। 2. तिल का उबटन लगाएं। 3. अग्नि में तिल अर्पित करें। 4. तिल खाएं। 5. तिल का पानी दें। 6. तिल का दान करें।\nआहार: अपने सादे भोजन (अनाज रहित) में तिल का प्रयोग करें।",
        "benefits": "गरीबी और दुर्भाग्य को ठीक करता है। इस दिन तिल का उपयोग करने से शरीर शुद्ध होता है और आध्यात्मिक ऐश्वर्य प्राप्त होता है।"
    },
    {
        "id": "3",
        "name": "जया एकादशी",
        "date": "2026-01-29",
        "fastStartTime": "06:41 AM",
        "fastBreakTime": "Jan 30, 06:41 AM - 10:32 AM",
        "description": "इसे भैमी एकादशी भी कहा जाता है। पिशाच योनि से मुक्ति प्रदान करती है।",
        "story": "इंद्र के दिव्य उद्यानों में, माल्यवान नामक एक गंधर्व और उसकी पत्नी पुष्पवती को पिशाच बनने और ठंडे हिमालय में पीड़ित होने का श्राप मिला था। संयोग से, उन्होंने जया एकादशी पर पूर्ण उपवास किया। इस व्रत की शक्ति ने उन्हें तुरंत उनके पिशाच शरीरों से मुक्त कर दिया और उनके दिव्य रूपों को बहाल कर दिया, यह साबित करते हुए कि एकादशी सबसे भारी कर्मों को जला देती है।",
        "fastingRules": "आहार: सात्विक आहार (फल/कंदमूल)। तेल और भारी मसालों से बचें।\nध्यान: पूर्वजों या निचली योनियों में फंसे लोगों की मुक्ति के लिए प्रार्थना करें।",
        "benefits": "उस कर्म को नष्ट कर देता है जो निचले जन्मों (जैसे भूत या जानवर) की ओर ले जाता है। यह प्रकृति के निचले गुणों पर विजय प्रदान करता है।"
    },
    {
        "id": "4",
        "name": "विजया एकादशी",
        "date": "2026-02-13",
        "fastStartTime": "06:36 AM",
        "fastBreakTime": "Feb 14, 06:36 AM - 10:29 AM",
        "description": "वह दिन जब भगवान राम ने समुद्र पार करने के लिए विजय मांगी थी।",
        "story": "जब भगवान राम लंका के सामने समुद्र के किनारे पहुंचे, तो उन्होंने पार करने का रास्ता खोजा। ऋषि बकदल्भ्य ने उन्हें विजया एकादशी का पालन करने की सलाह दी। भगवान ने भक्ति के साथ यह व्रत किया, और जल्द ही, वानर सेना ने सफलतापूर्वक पुल (सेतु) बनाया और रावण को हराया। यह दिन दुर्गम बाधाओं पर विजय प्रदान करता है।",
        "fastingRules": "पूजा: भगवान राम की पूजा करें।\nआहार: सादे फल/कंदमूल।\nजप: 'श्री राम जय राम जय जय राम' का जप करें।",
        "benefits": "भौतिक और आध्यात्मिक दोनों प्रयासों में विजय सुनिश्चित करता है। यह किसी को भौतिक कष्टों के सागर को पार करने में मदद करता है।"
    },
    {
        "id": "5",
        "name": "आमल्की एकादशी",
        "date": "2026-02-27",
        "fastStartTime": "06:27 AM",
        "fastBreakTime": "Feb 28, 06:26 AM - 10:23 AM",
        "description": "आंवले के पेड़ की पूजा। होली उत्सव की शुरुआत का प्रतीक है।",
        "story": "आंवले के पेड़ को भगवान विष्णु का विश्राम स्थल माना जाता है। राजा चित्रसेन, एक भक्त, एक बार जंगल में बर्बर लोगों द्वारा फंस गए थे। जैसे ही उन्होंने उन पर हमला करने की कोशिश की, उनके शरीर से एक दिव्य प्रकाश निकला (उनके आमल्की एकादशी के पालन द्वारा ईंधन) और उन्हें वश में कर लिया। यह दिन प्रकृति में पाई जाने वाली भगवान की सुरक्षात्मक शक्ति का जश्न मनाता है।",
        "fastingRules": "अनुष्ठान: आंवले के पेड़ को जल दें और पूजा करें। भगवान को आंवला फल अर्पित करें।\nआहार: अपने फलाहार में आंवले को शामिल करें।",
        "benefits": "महान पापों को नष्ट करता है। इस दिन आंवले के पेड़ की परिक्रमा करने से 1,000 गायों के दान का पुण्य मिलता है।"
    },
    {
        "id": "6",
        "name": "पापमोचनी एकादशी",
        "date": "2026-03-15",
        "fastStartTime": "06:15 AM",
        "fastBreakTime": "Mar 16, 06:14 AM - 10:14 AM",
        "description": "सभी पापों और मानसिक बंधनों को दूर करने वाला।",
        "story": "ऋषि मेधावी अप्सरा मंजुघोषा द्वारा मोहित हो गए और उन्होंने अपने ब्रह्मचर्य व्रत को तोड़ दिया, 57 वर्षों तक उनके साथ रहे। जब उन्हें अपने पतन का एहसास हुआ, तो वे बहुत दुखी हुए। उनके पिता, ऋषि च्यवन ने उन्हें पापमोचनी एकादशी का पालन करने की सलाह दी। इस व्रत से, मेधावी अपने पाप से मुक्त हो गए और अपनी आध्यात्मिक स्थिति पुनः प्राप्त कर ली।",
        "fastingRules": "ध्यान: तीव्र पश्चाताप और प्रार्थना।\nआहार: वासना और क्रोध के मन को शुद्ध करने के लिए सख्त उपवास की सिफारिश की जाती है।",
        "benefits": "सबसे गंभीर पापों को बेअसर करता है। यह भक्त के आध्यात्मिक जीवन के लिए अंतिम 'रीसेट' बटन है।"
    },
    {
        "id": "7",
        "name": "कामदा एकादशी",
        "date": "2026-03-29",
        "fastStartTime": "06:01 AM",
        "fastBreakTime": "Mar 30, 06:00 AM - 10:05 AM",
        "description": "सभी आध्यात्मिक और भौतिक इच्छाओं की पूर्ति करने वाला।",
        "story": "ललित, एक गंधर्व गायक, को आदमखोर राक्षस बनने का श्राप मिला था। उसकी पत्नी, ललिता ने कामदा एकादशी का पालन किया और मानसिक रूप से व्रत का पुण्य अपने पति को दे दिया। तुरंत, राक्षस रूप गायब हो गया, और ललित ने अपना दिव्य शरीर पुनः प्राप्त कर लिया। यह कहानी दूसरों के लिए निस्वार्थ उपवास की शक्ति पर प्रकाश डालती है।",
        "fastingRules": "आहार: मानक एकादशी नियम।\nइरादा: कोई भी इस व्रत का पुण्य किसी पीड़ित परिवार के सदस्य को समर्पित कर सकता है।",
        "benefits": "मानसिक विकृतियों और राक्षसी प्रभावों को ठीक करता है। यह आत्मा की गहरी इच्छाओं को पूरा करता है।"
    },
    {
        "id": "8",
        "name": "वरुथिनी एकादशी",
        "date": "2026-04-13",
        "fastStartTime": "05:48 AM",
        "fastBreakTime": "Apr 14, 05:47 AM - 09:56 AM",
        "description": "सुरक्षा और शाश्वत भाग्य प्रदान करता है।",
        "story": "राजा मान्धाता पर जंगल में एक भालू ने हमला किया और उनका पैर चबा लिया। उन्होंने भगवान विष्णु से प्रार्थना की, जिन्होंने उन्हें बचाया और वरुथिनी एकादशी का पालन करने की सलाह दी। न केवल उनका दर्द बंद हो गया, बल्कि उनका अंग भी चमत्कारिक रूप से बहाल हो गया, जो यह दर्शाता है कि यह व्रत भक्त को शारीरिक और आध्यात्मिक खतरे से कैसे बचाता है।",
        "fastingRules": "विशेष: शरीर पर तेल लगाने से बचें। कांसे की थाली में भोजन न करें। अहिंसा का पालन करें।",
        "benefits": "निर्भयता और दुर्भाग्य से सुरक्षा प्रदान करता है। पुण्य दस हजार वर्षों तक तपस्या करने के बराबर है।"
    },
    {
        "id": "9",
        "name": "मोहिनी एकादशी",
        "date": "2026-04-27",
        "fastStartTime": "05:37 AM",
        "fastBreakTime": "Apr 28, 05:36 AM - 09:48 AM",
        "description": "माया के भ्रम और भौतिक आसक्ति को काटता है।",
        "story": "राक्षसों से अमरता का अमृत वापस पाने के लिए भगवान विष्णु ने मोहिनी रूप धारण किया। इस दिन का पालन करने से आत्मा को उस 'मोह' (भ्रम) को दूर करने में मदद मिलती है जो उसे भौतिक दुनिया से बांधता है, जिससे वह भक्ति के अमृत का स्वाद चख सके।",
        "fastingRules": "ध्यान: दुनिया की अस्थायी प्रकृति पर ध्यान करें।\nआहार: पिछले दिन केवल एक बार भोजन करें। एकादशी पर सख्त उपवास।",
        "benefits": "'मैं' और 'मेरा' के भ्रम को नष्ट करता है। यह आध्यात्मिक स्पष्टता का मार्ग साफ करता है।"
    },
    {
        "id": "10",
        "name": "अपरा एकादशी",
        "date": "2026-05-13",
        "fastStartTime": "05:27 AM",
        "fastBreakTime": "May 14, 05:27 AM - 09:42 AM",
        "description": "असीमित ('अपरा') पुण्य और धन प्रदान करता है।",
        "story": "महीध्वज नामक राजा की उसके ईर्ष्यालु भाई ने हत्या कर दी और वह प्रेत बन गया। एक ऋषि ने उसकी ओर से अपरा एकादशी का पालन किया, और पुण्य इतना विशाल था कि उसने राजा को तुरंत उसके प्रेत रूप से मुक्त कर दिया और उसे वैकुंठ भेज दिया।",
        "fastingRules": "सख्त: दिन में अनाज, शहद और सोने से बचें।\nगतिविधि: आध्यात्मिक पुस्तकें या ज्ञान वितरित करें।",
        "benefits": "झूठी गवाही देने जैसे भारी अपराधों को भी नष्ट कर देता है। यह असीमित आध्यात्मिक पुण्य प्रदान करता है।"
    },
    {
        "id": "11",
        "name": "पद्मिनी एकादशी (अधिक)",
        "date": "2026-05-27",
        "fastStartTime": "05:26 AM",
        "fastBreakTime": "May 28, 05:26 AM - 09:42 AM",
        "description": "दुर्लभ अधिक मास एकादशी। हर 3 साल में एक बार आती है।",
        "story": "त्रेतायुग में, रानी पद्मिनी ने भगवान को प्रसन्न करने के लिए अतिरिक्त महीने (अधिक मास) में यह व्रत किया। भगवान इतने संतुष्ट हुए कि उन्होंने उसे एक पुत्र, कार्तवीर्य अर्जुन प्रदान किया, जो दुनिया का सबसे शक्तिशाली राजा बन गया। यह दिन भगवान कृष्ण को बहुत प्रिय है।",
        "fastingRules": "विशेष: 'ओम नमो भगवते वासुदेवाय' का 108 बार जप करें।\nआहार: यदि संभव हो तो निर्जला (बिना पानी के) व्रत की सिफारिश की जाती है।",
        "benefits": "पुण्य 1,000 गुना बढ़ जाता है क्योंकि यह पुरुषोत्तम मास में आता है। यह शुद्ध भक्ति प्रदान करता है।"
    },
    {
        "id": "12",
        "name": "परमा एकादशी (अधिक)",
        "date": "2026-06-11",
        "fastStartTime": "05:25 AM",
        "fastBreakTime": "Jun 12, 05:25 AM - 09:42 AM",
        "description": "अतिरिक्त महीने में गरीबी और पीड़ा को दूर करने वाला।",
        "story": "सुमेधा नाम का एक ब्राह्मण अत्यधिक गरीबी में रहता था। ऋषि कौंडिन्य ने उसे अधिक मास के दौरान परमा एकादशी का पालन करने की सलाह दी। ऐसा करने पर, देवताओं ने उस पर धन की वर्षा की, और उसने आध्यात्मिक गंतव्य प्राप्त किया।",
        "fastingRules": "आहार: शाम को केवल एक बार भोजन करें (फलाहार) या पूर्ण उपवास करें।\nदान: योग्य ब्राह्मणों को दान करें।",
        "benefits": "गरीबी और दुख के कर्म को दूर करता है। यह भगवान की व्यक्तिगत सेवा का दुर्लभ आशीर्वाद प्रदान करता है।"
    },
    {
        "id": "13",
        "name": "निर्जला एकादशी",
        "date": "2026-06-25",
        "fastStartTime": "05:26 AM",
        "fastBreakTime": "Jun 26, 05:26 AM - 09:42 AM",
        "description": "सबसे कठिन एकादशी। बिना पानी के उपवास।",
        "story": "सबसे शक्तिशाली पांडव भीम भूख बर्दाश्त नहीं कर सके और व्यासदेव से समाधान मांगा। उन्हें इस एकल एकादशी का पालन करने की सलाह दी गई—24 घंटे तक पानी से भी परहेज करना। वे सफल हुए, और इसलिए इसे पांडव निर्जला एकादशी कहा जाता है।",
        "fastingRules": "सख्त: सूर्योदय से सूर्योदय तक कोई भोजन और कोई पानी नहीं।\nअपवाद: केवल शुद्धि (आचमन) के लिए पानी का घूंट लें।",
        "benefits": "वर्ष में सभी 24 एकादशियों का पालन करने का पुण्य प्रदान करता है। यह जिद्दी पापों को जला देता है और वैकुंठ का मार्ग खोलता है।"
    },
    {
        "id": "14",
        "name": "योगिनी एकादशी",
        "date": "2026-07-10",
        "fastStartTime": "05:32 AM",
        "fastBreakTime": "Jul 11, 05:33 AM - 09:45 AM",
        "description": "रोग को ठीक करता है और शरीर को शुद्ध करता है।",
        "story": "माली हेममाली को अपने कर्तव्य की उपेक्षा करने के लिए कुष्ठ रोग का श्राप मिला था। उसने योगिनी एकादशी का पालन किया, और व्रत के पुण्य ने तुरंत उसके रोग को ठीक कर दिया, उसके सुंदर रूप को बहाल कर दिया।",
        "fastingRules": "आहार: सादे फल/कंदमूल। नमक से बचें।\nध्यान: भगवान की सेवा के लिए शरीर की शुद्धि के लिए प्रार्थना करें।",
        "benefits": "पिछले कर्मों के कारण होने वाले त्वचा रोगों और शारीरिक कष्टों को ठीक करता है। यह व्यक्ति को दुख के सागर से बचाता है।"
    },
    {
        "id": "15",
        "name": "देवशयनी एकादशी",
        "date": "2026-07-25",
        "fastStartTime": "05:40 AM",
        "fastBreakTime": "Jul 26, 05:41 AM - 09:50 AM",
        "description": "भगवान विष्णु योग निद्रा में प्रवेश करते हैं। चातुर्मास की शुरुआत।",
        "story": "इस दिन, भगवान विष्णु चार महीने के लिए क्षीर सागर में शेषनाग पर आराम करने जाते हैं। यह चातुर्मास की शुरुआत का प्रतीक है, जो तपस्या की अवधि है। भक्त इंद्रिय तृप्ति को कम करने के लिए विशेष व्रत लेते हैं।",
        "fastingRules": "व्रत: चातुर्मास के लिए संकल्प लें (उदाहरण के लिए, कोई पसंदीदा भोजन छोड़ना)।\nपूजा: भगवान विष्णु के 'सोने' से पहले उनकी आरती करें।",
        "benefits": "आध्यात्मिक तपस्या की शुरुआत का प्रतीक है। इसका पालन करना बरसात के मौसम में भगवान की सुरक्षा सुनिश्चित करता है।"
    },
    {
        "id": "16",
        "name": "कामिका एकादशी",
        "date": "2026-08-09",
        "fastStartTime": "05:49 AM",
        "fastBreakTime": "Aug 10, 05:50 AM - 09:55 AM",
        "description": "सर्वोच्च पापों को क्षमा करता है।",
        "story": "एक व्यक्ति जिसने गलती से एक ब्राह्मण को मार डाला था, उसे कामिका एकादशी का पालन करने की सलाह दी गई थी। इस दिन तुलसी के पत्तों से भगवान विष्णु की पूजा करना सोने के दान की किसी भी मात्रा से अधिक, भारी पापों को भी जलाने वाला कहा जाता है।",
        "fastingRules": "आवश्यक: भगवान विष्णु को तुलसी के पत्ते अर्पित करें।\nआहार: अनाज से उपवास।",
        "benefits": "नर्क के ग्रहों के भय से मुक्ति दिलाता है। यह आत्मा को आध्यात्मिक आकाश के लिए योग्य बनाता है।"
    },
    {
        "id": "17",
        "name": "श्रावण पुत्रदा एकादशी",
        "date": "2026-08-23",
        "fastStartTime": "05:57 AM",
        "fastBreakTime": "Aug 24, 05:58 AM - 10:00 AM",
        "description": "संतान के कल्याण के लिए मनाया जाता है।",
        "story": "राजा महीजित एक गाय के प्रति पिछले अपराध के कारण संतानहीन थे। इस एकादशी का पालन करने से, उनके पिछले कर्म धुल गए, और उन्हें एक योग्य पुत्र का आशीर्वाद मिला।",
        "fastingRules": "प्रार्थना: माता-पिता को अपने बच्चों के आध्यात्मिक कल्याण के लिए प्रार्थना करनी चाहिए।",
        "benefits": "परिवार रेखा में बाधाओं को दूर करता है। यह बच्चों और पूर्वजों की खुशी सुनिश्चित करता है।"
    },
    {
        "id": "18",
        "name": "अजा एकादशी",
        "date": "2026-09-07",
        "fastStartTime": "06:05 AM",
        "fastBreakTime": "Sep 08, 06:06 AM - 10:02 AM",
        "description": "खोई हुई संपत्ति और परिवार को पुनर्स्थापित करता है।",
        "story": "सत्य की परीक्षा में राजा हरिश्चंद्र ने अपना राज्य, पत्नी और बच्चे को खो दिया। श्मशान घाट के रक्षक के रूप में काम करते हुए, उन्होंने अजा एकादशी का पालन किया। व्रत के पुण्य ने उनके मृत पुत्र को जीवित कर दिया और उनका राज्य वापस कर दिया।",
        "fastingRules": "आहार: सादे फल/पानी।\nध्यान: सत्यता का अभ्यास करें।",
        "benefits": "खोई हुई किस्मत और प्रतिष्ठा को पुनर्स्थापित करता है। यह जीवन की सबसे कठिन परीक्षाओं को सहन करने की शक्ति देता है।"
    },
    {
        "id": "19",
        "name": "परिवर्तिनी एकादशी",
        "date": "2026-09-22",
        "fastStartTime": "06:12 AM",
        "fastBreakTime": "Sep 23, 06:13 AM - 10:05 AM",
        "description": "भगवान विष्णु अपनी करवट बदलते हैं (पार्श्व)।",
        "story": "अपनी ब्रह्मांडीय नींद के दौरान, भगवान विष्णु बाएं से दाएं करवट बदलते हैं। यह दिन वामन अवतार से भी जुड़ा है, जिन्होंने राजा बलि से तीन कदम भूमि ली थी। बलि ने तीसरे कदम के लिए अपना सिर समर्पित कर दिया, जो पूर्ण समर्पण का उदाहरण है।",
        "fastingRules": "पूजा: वामन अवतार।\nध्यान: अपने अहंकार को भगवान को समर्पित करें।",
        "benefits": "पापों को साफ करता है और भक्त को भगवान के प्रति पूर्ण समर्पण के करीब लाता है।"
    },
    {
        "id": "20",
        "name": "इंदिरा एकादशी",
        "date": "2026-10-06",
        "fastStartTime": "06:19 AM",
        "fastBreakTime": "Oct 07, 06:20 AM - 10:05 AM",
        "description": "पूर्वजों (पितृ) के लिए मुक्ति।",
        "story": "राजा इंद्रद्युम्न ने अपने पिता को मुक्त करने के लिए यह व्रत किया, जो यमलोक में पीड़ित थे। जैसे ही व्रत पूरा हुआ, आकाश से फूल बरसे, और उनके पिता वैकुंठ चले गए।",
        "fastingRules": "विशेष: पूर्वजों के लिए प्रार्थना/दान करें।\nआहार: पिछले दिन केवल एक बार भोजन करें।",
        "benefits": "पूर्वजों को नर्क की स्थितियों से बचाता है। यह दिवंगत लोगों के लिए सबसे बड़ा दान है।"
    },
    {
        "id": "21",
        "name": "पापांकुशा एकादशी",
        "date": "2026-10-22",
        "fastStartTime": "06:28 AM",
        "fastBreakTime": "Oct 23, 06:29 AM - 10:08 AM",
        "description": "अंकुश जो पाप रूपी हाथी को नियंत्रित करता है।",
        "story": "एक क्रूर शिकारी जिसने कभी कोई पवित्र कार्य नहीं किया था, उसे नर्क से बचा लिया गया क्योंकि उसने अनजाने में इस एकादशी का पालन किया था। पुण्य ने उसके भारी कर्मों को जलाकर राख कर दिया।",
        "fastingRules": "आहार: सख्त उपवास।\nध्यान: मन और इंद्रियों को नियंत्रित करें।",
        "benefits": "यह गारंटी देता है कि जीवन के अंत में व्यक्ति यमराज (मृत्यु) का चेहरा नहीं देखेगा।"
    },
    {
        "id": "22",
        "name": "रमा एकादशी",
        "date": "2026-11-05",
        "fastStartTime": "06:37 AM",
        "fastBreakTime": "Nov 06, 06:38 AM - 10:12 AM",
        "description": "देवी लक्ष्मी (रमा) के नाम पर रखा गया।",
        "story": "राजकुमारी चंद्रभागा के पति शोभन की इस व्रत का पालन करते हुए मृत्यु हो गई लेकिन उन्होंने एक दिव्य राज्य प्राप्त किया। वह बाद में उनके साथ शामिल हो गई और अपने पुण्य से उनके राज्य को शाश्वत बना दिया।",
        "fastingRules": "पूजा: भगवान दामोदर और लक्ष्मी देवी।\nगतिविधि: दीप दान करें।",
        "benefits": "भौतिक सुख और परम मुक्ति दोनों प्रदान करता है। देवी लक्ष्मी को प्रसन्न करता है।"
    },
    {
        "id": "23",
        "name": "देवोत्थान एकादशी",
        "date": "2026-11-20",
        "fastStartTime": "06:48 AM",
        "fastBreakTime": "Nov 21, 06:49 AM - 10:18 AM",
        "description": "भगवान विष्णु जागते हैं। चातुर्मास की समाप्ति।",
        "story": "भगवान विष्णु अपनी चार महीने की नींद से जागते हैं। भक्त तुलसी देवी और शालिग्राम (कृष्ण) का विवाह करके जश्न मनाते हैं, जो ईश्वर के साथ आत्मा के मिलन को दर्शाता है।",
        "fastingRules": "अनुष्ठान: तुलसी-विवाह।\nध्यान: चातुर्मास व्रत तोडें।",
        "benefits": "चातुर्मास के व्रतों को पूरा करता है। भक्त को अंतरंग सेवा के लिए योग्य बनाता है।"
    },
    {
        "id": "24",
        "name": "उत्पन्ना एकादशी",
        "date": "2026-12-04",
        "fastStartTime": "06:58 AM",
        "fastBreakTime": "Dec 05, 06:59 AM - 10:24 AM",
        "description": "एकादशी देवी का प्राकट्य।",
        "story": "एकादशी देवी राक्षस मुरा को मारने के लिए भगवान विष्णु के शरीर से प्रकट हुईं। प्रसन्न होकर, भगवान ने उन्हें पापों को नष्ट करने की शक्ति प्रदान की।",
        "fastingRules": "महत्व: शुरुआती लोगों के लिए आदर्श।\nप्रार्थना: इंद्रियों को नियंत्रित करने के लिए शक्ति के लिए प्रार्थना करें।",
        "benefits": "सभी एकादशी आशीर्वादों की उत्पत्ति। भगवान को बहुत प्रसन्न करता है।"
    },
    {
        "id": "25",
        "name": "मोक्षदा एकादशी",
        "date": "2026-12-20",
        "fastStartTime": "07:07 AM",
        "fastBreakTime": "Dec 21, 07:08 AM - 10:30 AM",
        "description": "गीता जयंती। जन्म और मृत्यु से मुक्ति।",
        "story": "वह दिन जब कृष्ण ने गीता बोली थी। एक राजा ने इस व्रत का पालन करके अपने पिता को नर्क से मुक्त कराया। यह साबित करता है कि गीता और एकादशी एक ही लक्ष्य की ओर ले जाते हैं।",
        "fastingRules": "गतिविधि: भगवद गीता पढ़ें।\nआहार: अनाज से उपवास।",
        "benefits": "पूर्वजों और पर्यवेक्षक को मुक्ति प्रदान करता है। आध्यात्मिक संदेहों को स्पष्ट करता है।"
    }
]