[
    {
        "id": "1",
        "name": "வைகுண்ட ஏகாதசி",
        "date": "2025-12-30",
        "fastStartTime": "06:35 AM",
        "fastBreakTime": "Dec 31, 06:36 AM - 10:25 AM",
        "description": "பௌஷ புத்ரதா ஏகாதசி என்றும் அழைக்கப்படுகிறது. இந்த நாளில் வைகுண்டத்தின் வாசல்கள் திறக்கப்படுகின்றன.",
        "story": "இது தொழில்நுட்ப ரீதியாக பௌஷ புத்ரதா ஏகாதசி என்றாலும், புனிதமான தனுர் மாதத்தில் வருவதால் இது வைகுண்ட ஏகாதசியாக கொண்டாடப்படுகிறது. இந்த நாளில் வைகுண்டத்தின் (ஆன்மீக உலகம்) வாசல்கள் திறக்கப்படுவதாக ஐதீகம். கோவில்களில் 'வைகுண்ட வாசல்' வழியாகச் செல்லும் பக்தர்கள் முக்தியை அடைவர் என்று கூறப்படுகிறது. வரலாற்று ரீதியாக, மஹிஜித் மன்னரும் ஒரு தகுதியான மகனைப் பெற இந்த விரதத்தை கடைபிடித்தார்.",
        "fastingRules": "கடுமையான விரதம்: தானியங்கள், பயறுகள் அல்லது அரிசி எதையும் உட்கொள்ளக்கூடாது. \nகவனம்: 'ஓம் நமோ நாராயணாய' என்று ஜபிக்கவும். \nசெயல்பாடு: அதிகாலையில் விஷ்ணு கோவிலுக்குச் சென்று பரமபத வாசல் வழியாகச் செல்லவும்.",
        "benefits": "முக்தியை அளிக்கிறது மற்றும் ஆன்மீக உலகத்திற்கான கதவுகளைத் திறக்கிறது. இது சந்ததி மற்றும் குடும்ப நலனில் உள்ள தடைகளை நீக்குகிறது."
    },
    {
        "id": "2",
        "name": "ஷட்டிலா ஏகாதசி",
        "date": "2026-01-14",
        "fastStartTime": "06:40 AM",
        "fastBreakTime": "Jan 15, 06:41 AM - 10:30 AM",
        "description": "எள் (திலா) நாள். வறுமை மற்றும் துரதிர்ஷ்டத்தை நீக்குகிறது.",
        "story": "ஒரு பணக்காரப் பெண் ஒருமுறை பிச்சைக்காரனுக்கு உணவுக்குப் பதிலாக ஒரு பிடி களிமண்ணைக் கொடுத்தாள். அவள் இறந்த பிறகு சொர்க்கத்திற்குச் சென்றாள், ஆனால் அங்கே உணவு இல்லாத வெற்று வீட்டைக் கண்டாள். அவள் இறைவனிடம் வேண்டினாள், அவர் அவளை ஷட்டிலா ஏகாதசியைக் கடைபிடிக்கச் சொன்னார். இந்த நாள் தானத்தின் முக்கியத்துவத்தை வலியுறுத்துகிறது. 'ஷட்-திலா' என்பது எள்ளை ஆறு வழிகளில் பயன்படுத்துவதைக் குறிக்கிறது, இது தூய்மை மற்றும் போஷாக்கைக் குறிக்கிறது.",
        "fastingRules": "எள்ளின் ஆறு பயன்பாடுகள்: 1. எள் நீரில் குளிக்கவும். 2. எள் விழுது பூசவும். 3. எள்ளை நெருப்பில் இடவும். 4. எள் சாப்பிடவும். 5. எள் நீர் கொடுக்கவும். 6. எள் தானம் செய்யவும். \nஉணவு: உங்கள் எளிய உணவில் (தானியமற்ற) எள்ளை பயன்படுத்தவும்.",
        "benefits": "வறுமை மற்றும் துரதிர்ஷ்டத்தைக் குணப்படுத்துகிறது. இந்த நாளில் எள்ளை பயன்படுத்துவது உடலைத் தூய்மையாக்குகிறது மற்றும் ஆன்மீக செல்வத்தை அளிக்கிறது."
    },
    {
        "id": "3",
        "name": "ஜெயா ஏகாதசி",
        "date": "2026-01-29",
        "fastStartTime": "06:41 AM",
        "fastBreakTime": "Jan 30, 06:41 AM - 10:32 AM",
        "description": "பைமி ஏகாதசி என்றும் அழைக்கப்படுகிறது. பேய் வாழ்க்கையிலிருந்து விடுதலை அளிக்கிறது.",
        "story": "இந்திரனின் தேவலோகத் தோட்டங்களில், மல்யவான் என்ற கந்தர்வனும் அவன் மனைவி புஷ்பவதியும் சபிக்கப்பட்டு பிசாசுகளாக (பேய்) மாறி இமயமலையின் குளிரில் அவதிப்பட்டனர். தற்செயலாக, அவர்கள் ஜெயா ஏகாதசி அன்று முழுமையாக விரதம் இருந்தனர். இந்த விரதத்தின் சக்தி உடனடியாக அவர்களை பேய் உடல்களிலிருந்து விடுவித்து அவர்களின் தேவலோக வடிவங்களை மீட்டெடுத்தது, ஏகாதசி மிகக் கடுமையான கர்மாவையும் எரிக்கும் என்பதை இது நிரூபிக்கிறது.",
        "fastingRules": "உணவு: சாத்வீக உணவு (பழங்கள்/கிழங்குகள்). எண்ணெய் மற்றும் காரமான மசாலாக்களைத் தவிர்க்கவும். \nகவனம்: முன்னோர்கள் அல்லது கீழ் உலகங்களில் சிக்கியிருப்பவர்களின் விடுதலைக்காகப் பிரார்த்திக்கவும்.",
        "benefits": "கீழ் பிறப்புகளுக்கு (பேய் அல்லது விலங்குகள் போன்றவை) வழிவகுக்கும் கர்மாவை அழிக்கிறது. இது இயற்கையின் கீழ் குணங்களின் மீது வெற்றியை அளிக்கிறது."
    },
    {
        "id": "4",
        "name": "விஜயா ஏகாதசி",
        "date": "2026-02-13",
        "fastStartTime": "06:36 AM",
        "fastBreakTime": "Feb 14, 06:36 AM - 10:29 AM",
        "description": "இராமர் கடலைக் கடக்க வெற்றி தேடிய நாள்.",
        "story": "இராமர் லங்கையை நோக்கிப் பெருங்கடலின் கரையை அடைந்தபோது, அதைக் கடக்க வழி தேடினார். பக்கதால்பிய முனிவர் அவருக்கு விஜயா ஏகாதசியைக் கடைபிடிக்க அறிவுறுத்தினார். இராமர் இந்த விரதத்தை பக்தியுடன் செய்தார், விரைவில் வானர சேனை வெற்றிகரமாக பாலம் (சேது) கட்டி ராவணனைத் தோற்கடித்தது. இந்த நாள் கடக்க முடியாத தடைகளை வெல்லும் வெற்றியை அளிக்கிறது.",
        "fastingRules": "வழிபாடு: இராமரை வழிபடவும். \nஉணவு: எளிய பழங்கள்/கிழங்குகள். \nஜபம்: 'ஸ்ரீ ராம ஜெய ராம ஜெய ஜெய ராம'.",
        "benefits": "பொருள் மற்றும் ஆன்மீக என அனைத்து முயற்சிகளிலும் வெற்றியை உறுதி செய்கிறது. இது ஜடத் துன்பம் என்னும் கடலைக் கடக்க உதவுகிறது."
    },
    {
        "id": "5",
        "name": "ஆமலகி ஏகாதசி",
        "date": "2026-02-27",
        "fastStartTime": "06:27 AM",
        "fastBreakTime": "Feb 28, 06:26 AM - 10:23 AM",
        "description": "நெல்லிக்காய் (ஆம்லா) மர வழிபாடு. ஹோலி கொண்டாட்டங்களின் தொடக்கத்தைக் குறிக்கிறது.",
        "story": "நெல்லிக்காய் மரம் விஷ்ணுவின் உறைவிடமாகப் போற்றப்படுகிறது. சித்ரசேனன் என்ற மன்னன், ஒரு பக்தன், ஒருமுறை காட்டில் காட்டுமிராண்டிகளிடம் சிக்கிக்கொண்டான். அவர்கள் அவனைத் தாக்க முயன்றபோது, அவன் உடலில் இருந்து ஒரு தெய்வீக ஒளி (அவன் ஆமலகி ஏகாதசியைக் கடைபிடித்ததால்) வெளிப்பட்டு அவர்களை அடக்கியது. இந்த நாள் இயற்கையில் காணப்படும் இறைவனின் பாதுகாக்கும் சக்தியைக் கொண்டாடுகிறது.",
        "fastingRules": "சடங்கு: நெல்லிக்காய் மரத்திற்கு நீர் ஊற்றி வழிபடவும். நெல்லிக்கனியை இறைவனுக்குப் படைக்கவும். \nஉணவு: உங்கள் பலகாரத்தில் (தானியமற்ற உணவு) நெல்லிக்காயைச் சேர்க்கவும்.",
        "benefits": "பெரும் பாவங்களை அழிக்கிறது. இந்த நாளில் நெல்லிக்காய் மரத்தைச் சுற்றி வருவது 1,000 பசுக்களை தானம் செய்த புண்ணியத்தை அளிக்கிறது."
    },
    {
        "id": "6",
        "name": "பாபமோச்சனி ஏகாதசி",
        "date": "2026-03-15",
        "fastStartTime": "06:15 AM",
        "fastBreakTime": "Mar 16, 06:14 AM - 10:14 AM",
        "description": "அனைத்து பாவங்களையும் மனக் கட்டுப்பாடுகளையும் நீக்குபவர்.",
        "story": "மேதாவி என்ற முனிவர் மஞ்சுஷோஷா என்ற அப்சரஸால் கவரப்பட்டு தனது பிரம்மச்சரிய விரதத்தை முறித்துக் கொண்டார், அவருடன் 57 ஆண்டுகள் வாழ்ந்தார். அவர் தனது வீழ்ச்சியை உணர்ந்தபோது, அவர் மனம் கலங்கினார். அவரது தந்தை, சியவன முனிவர், அவருக்கு பாபமோச்சனி ஏகாதசியைக் கடைபிடிக்க அறிவுறுத்தினார். இந்த விரதத்தின் மூலம், மேதாவி தனது பாவத்திலிருந்து விடுபட்டு தனது ஆன்மீக நிலையை மீண்டும் பெற்றார்.",
        "fastingRules": "கவனம்: தீவிர மனம்மாற்றம் மற்றும் பிரார்த்தனை. \nஉணவு: காமம் மற்றும் கோபத்திலிருந்து மனதைத் தூய்மைப்படுத்த கடுமையான விரதம் பரிந்துரைக்கப்படுகிறது.",
        "benefits": "மிகக் கொடிய பாவங்களை நடுநிலையாக்குகிறது. இது ஒரு பக்தரின் ஆன்மீக வாழ்க்கைக்கு இறுதி 'மீட்டமைப்பு' பொத்தான்."
    },
    {
        "id": "7",
        "name": "காமதா ஏகாதசி",
        "date": "2026-03-29",
        "fastStartTime": "06:01 AM",
        "fastBreakTime": "Mar 30, 06:00 AM - 10:05 AM",
        "description": "அனைத்து ஆன்மீக மற்றும் லௌகீக ஆசைகளையும் நிறைவேற்றுபவர்.",
        "story": "லலித் என்ற தேவலோகப் பாடகன் நரமாமிசம் உண்ணும் அரக்கனாக மாற சபிக்கப்பட்டான். அவன் மனைவி லலிதா காமதா ஏகாதசியைக் கடைபிடித்து, அந்தப் புண்ணியத்தை மனதாரத் தன் கணவனுக்கு மாற்றினாள். உடனடியாக, அரக்க வடிவம் மறைந்தது, லலித் தனது தேவலோக உடலை மீண்டும் பெற்றான். இந்த கதை மற்றவர்களுக்காக சுயநலமின்றி விரதம் இருப்பதன் சக்தியை எடுத்துக்காட்டுகிறது.",
        "fastingRules": "உணவு: நிலையான ஏகாதசி விதிகள். \nநோக்கம்: இந்த விரதத்தின் புண்ணியத்தை துன்பப்படும் குடும்ப உறுப்பினருக்கு அர்ப்பணிக்கலாம்.",
        "benefits": "மனச் சிதைவுகள் மற்றும் தீய சக்திகளின் தாக்கங்களைக் குணப்படுத்துகிறது. இது ஆன்மாவின் ஆழ்ந்த ஆசைகளை நிறைவேற்றுகிறது."
    },
    {
        "id": "8",
        "name": "வருதினி ஏகாதசி",
        "date": "2026-04-13",
        "fastStartTime": "05:48 AM",
        "fastBreakTime": "Apr 14, 05:47 AM - 09:56 AM",
        "description": "பாதுகாப்பு மற்றும் நித்திய செல்வத்தை அளிக்கிறது.",
        "story": "மாந்தாதா மன்னன் காட்டில் ஒரு கரடியால் தாக்கப்பட்டு அவன் கால் மெல்லப்பட்டது. அவன் விஷ்ணுவிடம் வேண்டினான், அவர் அவனைக் காப்பாற்றி வருதினி ஏகாதசியைக் கடைபிடிக்க அறிவுறுத்தினார். அவனது வலி நின்றது மட்டுமல்லாமல், அவனது உறுப்பு அதிசயமாக மீட்டெடுக்கப்பட்டது, இது இந்த விரதம் பக்தரை உடல் மற்றும் ஆன்மீக ஆபத்துகளிலிருந்து எவ்வாறு பாதுகாக்கிறது என்பதைக் குறிக்கிறது.",
        "fastingRules": "விவரங்கள்: உடலில் எண்ணெய் பூசுவதைத் தவிர்க்கவும். வெண்கலத் தட்டுகளில் சாப்பிட வேண்டாம். அகிம்சையைக் கடைபிடிக்கவும்.",
        "benefits": "அச்சமின்மை மற்றும் துரதிர்ஷ்டதிலிருந்து பாதுகாப்பை அளிக்கிறது. இதன் புண்ணியம் பத்தாயிரம் ஆண்டுகள் தவம் செய்வதற்கு சமம்."
    },
    {
        "id": "9",
        "name": "மோகினி ஏகாதசி",
        "date": "2026-04-27",
        "fastStartTime": "05:37 AM",
        "fastBreakTime": "Apr 28, 05:36 AM - 09:48 AM",
        "description": "மாயை மற்றும் பொருள் பற்றுதலின் மாயையை வெட்டுகிறது.",
        "story": "அசுரர்களிடமிருந்து அமிர்தத்தை மீட்க விஷ்ணு மோகினி அவதாரம் எடுத்தார். இந்த நாளைக் கடைபிடிப்பது ஆன்மா ஜட உலகத்துடன் பிணைக்கும் 'மோகத்தை' (மாயை) வென்று, பக்தியின் அமிர்தத்தைச் சுவைக்க உதவுகிறது.",
        "fastingRules": "கவனம்: உலகின் தற்காலிக தன்மையை தியானிக்கவும். \nஉணவு: முந்தைய நாள் ஒரு முறை மட்டும் சாப்பிடவும். ஏகாதசி அன்று கடுமையான விரதம்.",
        "benefits": "'நான்' மற்றும் 'எனது' என்ற மாயையை அழிக்கிறது. இது ஆன்மீகத் தெளிவுக்கான பாதையைத் தெளிவுபடுத்துகிறது."
    },
    {
        "id": "10",
        "name": "அபரா ஏகாதசி",
        "date": "2026-05-13",
        "fastStartTime": "05:27 AM",
        "fastBreakTime": "May 14, 05:27 AM - 09:42 AM",
        "description": "எல்லையற்ற ('அபரா') புண்ணியத்தையும் செல்வத்தையும் அளிக்கிறது.",
        "story": "மஹித்வஜான் என்ற அரசன் அவனது பொறாமை கொண்ட சகோதரனால் கொல்லப்பட்டு பேயாக மாறினான். ஒரு முனிவர் அவன் சார்பாக அபரா ஏகாதசியைக் கடைபிடித்தார், அந்தப் புண்ணியம் மிகவும் பரந்ததாக இருந்ததால் அது உடனடியாக அரசனை அவனது பேய் வடிவத்திலிருந்து விடுவித்து வைகுண்டத்திற்கு அனுப்பியது.",
        "fastingRules": "கடுமையானது: பகலில் தானியங்கள், தேன் மற்றும் தூக்கத்தைத் தவிர்க்கவும். \nசெயல்பாடு: ஆன்மீக புத்தகங்கள் அல்லது அறிவைப் விநியோகிக்கவும்.",
        "benefits": "பொய்சாட்சி சொல்வது போன்ற கடுமையான குற்றங்களை ரத்து செய்கிறது. இது எல்லையற்ற ஆன்மீகப் புண்ணியத்தை அளிக்கிறது."
    },
    {
        "id": "11",
        "name": "பத்மினி ஏகாதசி (அதிகம்)",
        "date": "2026-05-27",
        "fastStartTime": "05:26 AM",
        "fastBreakTime": "May 28, 05:26 AM - 09:42 AM",
        "description": "அரிய அதிக மாத ஏகாதசி. 3 ஆண்டுகளுக்கு ஒரு முறை வரும்.",
        "story": "திரேதா யுகத்தில், ராணி பத்மினி இறைவனை மகிழ்விக்க அதிக மாதத்தில் இந்த விரதத்தைக் கடைபிடித்தார். இறைவன் மிகவும் திருப்தியடைந்து அவளுக்கு கார்த்தவீர்ய அர்ஜுனன் என்ற மகனை வரமாக அளித்தார், அவன் உலகின் வலிமையான அரசனானான். இந்த நாள் கிருஷ்ணருக்கு மிகவும் பிடித்தமானது.",
        "fastingRules": "சிறப்பு: 'ஓம் நமோ பகவதே வாசுதேவாய' என்று 108 முறை ஜபிக்கவும். \nஉணவு: முடிந்தால் நிர்ஜல (நீர் இல்லாமல்) விரதம் பரிந்துரைக்கப்படுகிறது.",
        "benefits": "புருஷோத்தம மாதத்தில் வருவதால் இதன் புண்ணியம் 1,000 மடங்கு பெருகும். இது தூய பக்தியை அளிக்கிறது."
    },
    {
        "id": "12",
        "name": "பரம ஏகாதசி (அதிகம்)",
        "date": "2026-06-11",
        "fastStartTime": "05:25 AM",
        "fastBreakTime": "Jun 12, 05:25 AM - 09:42 AM",
        "description": "கூடுதல் மாதத்தில் வறுமை மற்றும் துன்பத்தை நீக்குபவர்.",
        "story": "சுமேதா என்ற அந்தணர் கடும் வறுமையில் வாழ்ந்தார். கௌண்டின்ய முனிவர் அவருக்கு அதிக மாதத்தில் பரம ஏகாதசியைக் கடைபிடிக்க அறிவுறுத்தினார். அவ்வாறு செய்தவுடன், தேவர்கள் அவர் மீது செல்வத்தைப் பொழிந்தனர், மேலும் அவர் ஆன்மீக நிலையை அடைந்தார்.",
        "fastingRules": "உணவு: மாலையில் ஒரு முறை மட்டும் (பலகாரம்) சாப்பிடவும் அல்லது முழு விரதம் இருக்கவும். \nதானம்: தகுதியான அந்தணர்களுக்கு தானம் செய்யுங்கள்.",
        "benefits": "வறுமை மற்றும் துன்பத்தின் கர்மாவைப் போக்குகிறது. இது இறைவனுக்கு தனிப்பட்ட சேவை செய்யும் அரிய வரத்தை அளிக்கிறது."
    },
    {
        "id": "13",
        "name": "நிர்ஜல ஏகாதசி",
        "date": "2026-06-25",
        "fastStartTime": "05:26 AM",
        "fastBreakTime": "Jun 26, 05:26 AM - 09:42 AM",
        "description": "மிகக் கடினமான ஏகாதசி. நீர் இல்லாமல் விரதம்.",
        "story": "மிக வலிமையான பாண்டவரான பீமனால் பசியைத் தாங்க முடியவில்லை, வியாசரிடம் தீர்வு கேட்டார். இந்த ஒற்றை ஏகாதசியைக் கடைபிடிக்க அவருக்கு அறிவுறுத்தப்பட்டது—24 மணிநேரம் தண்ணீர் கூட அருந்தாமல். அவர் வெற்றி பெற்றார், அதனால் இது பாண்டவ நிர்ஜல ஏகாதசி என்று அழைக்கப்படுகிறது.",
        "fastingRules": "கடுமையானது: சூரிய உதயம் முதல் சூரிய உதயம் வரை உணவு இல்லை மற்றும் நீர் இல்லை. \nவிதிவிலக்கு: சுத்திகரிப்புக்காக (ஆசமனம்) மட்டும் நீர் அருந்தலாம்.",
        "benefits": "வருடத்தில் அனைத்து 24 ஏகாதசிகளையும் கடைபிடிப்பதன் புண்ணியத்தை அளிக்கிறது. இது பிடிவாதமான பாவங்களை எரித்து வைகுண்டத்திற்கான பாதையைத் திறக்கிறது."
    },
    {
        "id": "14",
        "name": "யோகினி ஏகாதசி",
        "date": "2026-07-10",
        "fastStartTime": "05:32 AM",
        "fastBreakTime": "Jul 11, 05:33 AM - 09:45 AM",
        "description": "நோயைக் குணப்படுத்துகிறது மற்றும் உடலைத் தூய்மையாக்குகிறது.",
        "story": "தோட்டக்காரன் ஹேமமாலி தன் கடமையைப் புறக்கணித்ததால் தொழுநோயால் சபிக்கப்பட்டான். அவன் யோகினி ஏகாதசியைக் கடைபிடித்தான், விரதத்தின் புண்ணியம் உடனடியாக அவனது நோயைக் குணப்படுத்தி, அவனது அழகான வடிவத்தை மீட்டெடுத்தது.",
        "fastingRules": "உணவு: எளிய பழங்கள்/கிழங்குகள். உப்பு தவிர்க்கவும். \nகவனம்: இறைவனின் சேவைக்காக உடல் தூய்மைக்காகப் பிரார்த்திக்கவும்.",
        "benefits": "கடந்தகால கர்மாவால் ஏற்படும் தோல் நோய்கள் மற்றும் உடல் துன்பங்களைக் குணப்படுத்துகிறது. இது துன்பக் கடலிலிருந்து ஒருவரை விடுவிக்கிறது."
    },
    {
        "id": "15",
        "name": "தேவசயனி ஏகாதசி",
        "date": "2026-07-25",
        "fastStartTime": "05:40 AM",
        "fastBreakTime": "Jul 26, 05:41 AM - 09:50 AM",
        "description": "விஷ்ணு யோக நித்திரைக்குச் செல்கிறார். சாதுர்மாஸ்ய விரதத்தின் தொடக்கம்.",
        "story": "இந்த நாளில், விஷ்ணு பாற்கடலில் ஆதிசேஷன் மீது நான்கு மாதங்கள் ஓய்வெடுக்கச் செல்கிறார். இது தவக் காலமான சாதுர்மாஸ்ய விரதத்தின் தொடக்கத்தைக் குறிக்கிறது. பக்தர்கள் புலன் இன்பத்தைக் குறைக்க சிறப்பு விரதங்களை மேற்கொள்கின்றனர்.",
        "fastingRules": "விரதம்: சாதுர்மாஸ்ய சங்கல்பம் எடுத்துக்கொள்ளவும் (எ.கா., பிடித்த உணவைக் கைவிடுதல்). \nவழிபாடு: விஷ்ணு 'தூங்கும்' முன் அவருக்கு ஆர்த்தி செய்யவும்.",
        "benefits": "ஆன்மீகத் தவத்தின் தொடக்கத்தைக் குறிக்கிறது. இதைக் கடைபிடிப்பது மழைக்காலத்தில் இறைவனின் பாதுகாப்பை உறுதி செய்கிறது."
    },
    {
        "id": "16",
        "name": "காமிகா ஏகாதசி",
        "date": "2026-08-09",
        "fastStartTime": "05:49 AM",
        "fastBreakTime": "Aug 10, 05:50 AM - 09:55 AM",
        "description": "மிக உயர்ந்த பாவங்களை மன்னிக்கிறது.",
        "story": "தற்செயலாக ஒரு அந்தணனைக் கொன்ற ஒரு மனிதனுக்கு காமிகா ஏகாதசியைக் கடைபிடிக்க அறிவுறுத்தப்பட்டது. இந்த நாளில் துளசி இலைகளால் விஷ்ணுவை வழிபடுவது, எந்த அளவு தங்கம் தானம் செய்தாலும் கிடைப்பதை விட, மிகக் கடுமையான பாவங்களைக் கூட எரித்துவிடும் என்று கூறப்படுகிறது.",
        "fastingRules": "அவசியம்: விஷ்ணுவுக்கு துளசி இலைகளை அர்ப்பணிக்கவும். \nஉணவு: தானியங்களைத் தவிர்க்கவும்.",
        "benefits": "நரக லோகங்களின் பயத்திலிருந்து ஒருவரை விடுவிக்கிறது. இது ஆன்மாவை ஆன்மீக வானத்திற்குத் தகுதிப்படுத்துகிறது."
    },
    {
        "id": "17",
        "name": "ஷ்ரவண புத்ரதா ஏகாதசி",
        "date": "2026-08-23",
        "fastStartTime": "05:57 AM",
        "fastBreakTime": "Aug 24, 05:58 AM - 10:00 AM",
        "description": "குழந்தைகளின் நலனுக்காகக் கடைபிடிக்கப்படுகிறது.",
        "story": "மஹிஜித் மன்னன் பசுவுக்கு எதிரான கடந்தகால குற்றத்தால் குழந்தையில்லாமல் இருந்தான். இந்த ஏகாதசியைக் கடைபிடித்ததன் மூலம், அவனது கடந்தகால கர்மா கழுவப்பட்டு, அவனுக்கு ஒரு தகுதியான மகன் பிறந்தான்.",
        "fastingRules": "பிரார்த்தனைகள்: பெற்றோர்கள் தங்கள் குழந்தைகளின் ஆன்மீக நலனுக்காகப் பிரார்த்திக்க வேண்டும்.",
        "benefits": "குடும்ப வம்சத்தில் உள்ள தடைகளை நீக்குகிறது. இது குழந்தைகள் மற்றும் முன்னோர்களின் மகிழ்ச்சியை உறுதி செய்கிறது."
    },
    {
        "id": "18",
        "name": "அஜா ஏகாதசி",
        "date": "2026-09-07",
        "fastStartTime": "06:05 AM",
        "fastBreakTime": "Sep 08, 06:06 AM - 10:02 AM",
        "description": "இழந்த செல்வம் மற்றும் குடும்பத்தை மீட்டெடுக்கிறது.",
        "story": "ஹரிச்சந்திர மன்னன் சத்திய சோதனையில் தன் ராஜ்யம், மனைவி மற்றும் குழந்தையை இழந்தான். சுடுகாட்டு காவலனாக வேலை செய்து கொண்டிருந்த போது, அவன் அஜா ஏகாதசியைக் கடைபிடித்தான். விரதத்தின் புண்ணியம் அவனது இறந்த மகனை உயிர்ப்பித்தது மற்றும் அவனது ராஜ்யத்தை மீட்டெடுத்தது.",
        "fastingRules": "உணவு: எளிய பழங்கள்/நீர். \nகவனம்: சத்தியத்தைக் கடைபிடிக்கவும்.",
        "benefits": "இழந்த அதிர்ஷ்டம் மற்றும் நற்பெயரை மீட்டெடுக்கிறது. வாழ்க்கையின் கடினமான சோதனைகளைத் தாங்க இது வலிமை அளிக்கிறது."
    },
    {
        "id": "19",
        "name": "பரிவர்த்தினி ஏகாதசி",
        "date": "2026-09-22",
        "fastStartTime": "06:12 AM",
        "fastBreakTime": "Sep 23, 06:13 AM - 10:05 AM",
        "description": "விஷ்ணு ஒரு பக்கமாகத் திரும்புகிறார் (பார்ஸ்வ).",
        "story": "தனது பிரபஞ்ச உறக்கத்தின் போது, விஷ்ணு இடமிருந்து வலமாகத் திரும்புகிறார். இந்த நாள் வாமன அவதாரத்துடனும் தொடர்புடையது, அவர் மகாபலி சக்கரவர்த்தியிடம் இருந்து மூன்று அடி நிலம் கேட்டார். மூன்றாவது அடிக்கு பலி தன் தலையைக் கொடுத்தார், இது முழுமையான சரணாகதிக்கு எடுத்துக்காட்டு.",
        "fastingRules": "வழிபாடு: வாமன அவதாரம். \nகவனம்: உங்கள் அகங்காரத்தை இறைவனிடம் சரணடையுங்கள்.",
        "benefits": "பாவங்களைத் தூய்மைப்படுத்துகிறது மற்றும் பக்தரை இறைவனிடம் முழுமையான சரணாகதிக்கு நெருக்கமாக்குகிறது."
    },
    {
        "id": "20",
        "name": "இந்திரா ஏகாதசி",
        "date": "2026-10-06",
        "fastStartTime": "06:19 AM",
        "fastBreakTime": "Oct 07, 06:20 AM - 10:05 AM",
        "description": "முன்னோர்களுக்கான முக்தி (பித்ரு).",
        "story": "இந்திரத்யும்ன மன்னன் எமலோகம் நரகத்தில் துன்புற்ற தன் தந்தையை விடுவிக்க இந்த விரதத்தைக் கடைபிடித்தான். விரதம் முடிந்தவுடனே, வானத்திலிருந்து பூக்கள் பொழிந்தன, அவன் தந்தை வைகுண்டத்திற்குச் சென்றான்.",
        "fastingRules": "சிறப்பு: முன்னோர்களுக்குப் பிரார்த்தனை/தானம் செய்யவும். \nஉணவு: முந்தைய நாள் ஒரு முறை மட்டும் சாப்பிடவும்.",
        "benefits": "முன்னோர்களை நரக நிலைகளிலிருந்து விடுவிக்கிறது. இது மறைந்தவர்களுக்குச் செய்யும் மிகச்சிறந்த தானம்."
    },
    {
        "id": "21",
        "name": "பாபாங்குஷ ஏகாதசி",
        "date": "2026-10-22",
        "fastStartTime": "06:28 AM",
        "fastBreakTime": "Oct 23, 06:29 AM - 10:08 AM",
        "description": "பாவம் என்னும் யானையைக் கட்டுப்படுத்தும் அங்குசம்.",
        "story": "ஒரு நற்செயல் கூட செய்யாத ஒரு கொடூரமான வேடன், அறியாமலேயே இந்த ஏகாதசியைக் கடைபிடித்ததால் நரகத்திலிருந்து காப்பாற்றப்பட்டான். அந்தப் புண்ணியம் அவனது கடுமையான கர்மாவைச் சாம்பலாக்கியது.",
        "fastingRules": "உணவு: கடுமையான விரதம். \nகவனம்: மனம் மற்றும் புலன்களைக் கட்டுப்படுத்தவும்.",
        "benefits": "வாழ்க்கையின் இறுதியில் எமதர்மராஜாவின் (இறப்பு) முகத்தைப் பார்க்க மாட்டார்கள் என்று உத்தரவாதம் அளிக்கிறது."
    },
    {
        "id": "22",
        "name": "ரமா ஏகாதசி",
        "date": "2026-11-05",
        "fastStartTime": "06:37 AM",
        "fastBreakTime": "Nov 06, 06:38 AM - 10:12 AM",
        "description": "லட்சுமி தேவியின் (ரமா) பெயரால் அழைக்கப்படுகிறது.",
        "story": "சந்திரபாகா இளவரசியின் கணவன் சோபனன் இந்த விரதத்தைக் கடைபிடித்து இறந்தான், ஆனால் ஒரு தேவலோக ராஜ்யத்தை அடைந்தான். அவள் பின்னர் அவனுடன் சேர்ந்து, தன் சொந்தப் புண்ணியத்தால் அவனது ராஜ்யத்தை நித்தியமாக்கினாள்.",
        "fastingRules": "வழிபாடு: தாமோதரர் மற்றும் லட்சுமி தேவி. \nசெயல்பாடு: விளக்கேற்றவும் (தீப தானம்).",
        "benefits": "லௌகீக இன்பம் மற்றும் இறுதி முக்தி இரண்டையும் அளிக்கிறது. லட்சுமி தேவியை மகிழ்விக்கிறது."
    },
    {
        "id": "23",
        "name": "தேவுத்தான ஏகாதசி",
        "date": "2026-11-20",
        "fastStartTime": "06:48 AM",
        "fastBreakTime": "Nov 21, 06:49 AM - 10:18 AM",
        "description": "விஷ்ணு விழித்தெழுகிறார். சாதுர்மாஸ்ய விரதழிவு.",
        "story": "விஷ்ணு தனது நான்கு மாத உறக்கத்திலிருந்து விழித்தெழுகிறார். துளசி தேவி மற்றும் சாளக்கிராமத்தின் (கிருஷ்ணர்) திருமணத்தை நடத்தி பக்தர்கள் கொண்டாடுகிறார்கள், இது ஆன்மா இறைவனுடன் இணைவதைக் குறிக்கிறது.",
        "fastingRules": "சடங்கு: துளசி விவாகம். \nகவனம்: சாதுர்மாஸ்ய சங்கல்பங்களை முடித்தல்.",
        "benefits": "சாதுர்மாஸ்ய விரதங்களை நிறைவு செய்கிறது. பக்தரை நெருக்கமான சேவைக்குத் தகுதிப்படுத்துகிறது."
    },
    {
        "id": "24",
        "name": "உத்பன்ன ஏகாதசி",
        "date": "2026-12-04",
        "fastStartTime": "06:58 AM",
        "fastBreakTime": "Dec 05, 06:59 AM - 10:24 AM",
        "description": "ஏகாதசி தேவியின் தோற்றம்.",
        "story": "முரன் என்ற அரக்கனைக் கொல்ல விஷ்ணுவின் உடலில் இருந்து ஏகாதசி தேவி தோன்றினாள். மகிழ்ந்த இறைவன் அவளுக்குப் பாவங்களை அழிக்கும் சக்தியை வரமாக அளித்தார்.",
        "fastingRules": "முக்கியத்துவம்: ஆரம்பநிலையாளர்களுக்கு ஏற்றது. \nபிரார்த்தனை: புலன்களைக் கட்டுப்படுத்த வலிமை வேண்டிப் பிரார்த்திக்கவும்.",
        "benefits": "அனைத்து ஏகாதசி ஆசீர்வாதங்களின் தொடக்கம். இறைவனைப் பெரிதும் மகிழ்விக்கிறது."
    },
    {
        "id": "25",
        "name": "மோட்சதா ஏகாதசி",
        "date": "2026-12-20",
        "fastStartTime": "07:07 AM",
        "fastBreakTime": "Dec 21, 07:08 AM - 10:30 AM",
        "description": "கீதா ஜெயந்தி. பிறப்பு மற்றும் இறப்பிலிருந்து விடுதலை.",
        "story": "கிருஷ்ணர் கீதையைப் போதித்த நாள். ஒரு மன்னன் இந்த விரதத்தைக் கடைபிடித்து தன் தந்தையை நரகத்திலிருந்து விடுவித்தான். கீதை மற்றும் ஏகாதசி ஒரே இலக்கிற்கு இட்டுச் செல்லும் என்பதை இது நிரூபிக்கிறது.",
        "fastingRules": "செயல்பாடு: பகவத் கீதை படிக்கவும். \nஉணவு: தானியங்களைத் தவிர்க்கவும்.",
        "benefits": "முன்னோர்களுக்கும் கடைபிடிப்பவருக்கும் முக்தியை அளிக்கிறது. ஆன்மீக ஐயங்களைத் தெளிவுபடுத்துகிறது."
    }
]