[
  {
    "id": "1",
    "name": "Vaikunta Ekadashi",
    "date": "2025-12-30",
    "fastStartTime": "06:35 AM",
    "fastBreakTime": "Dec 31, 06:36 AM - 10:25 AM",
    "description": "Also known as Pausha Putrada Ekadashi. The gates of Vaikuntha open on this day.",
    "story": "While technically Pausha Putrada Ekadashi, this day is celebrated as Vaikunta Ekadashi because it falls in the sacred Dhanur month. Legend says that on this day, the gates of Vaikuntha (the spiritual realm) are flung open. Devotees who pass through the 'Vaikunta Dwara' in temples are said to attain liberation. Historically, King Mahijit also observed this fast to be blessed with a worthy son who would continue his dharmic lineage.",
    "fastingRules": "Strict Fast: Consume no grains, beans, or rice. \nFocus: Chant 'Om Namo Narayanaya'. \nActivity: Visit a Vishnu temple early morning to pass through the Northern Gate (Paramapada Vaasal).",
    "benefits": "Grants liberation (Moksha) and opens the doors to the spiritual world. It also removes obstacles in progeny and family welfare."
  },
  {
    "id": "2",
    "name": "Shattila Ekadashi",
    "date": "2026-01-14",
    "fastStartTime": "06:40 AM",
    "fastBreakTime": "Jan 15, 06:41 AM - 10:30 AM",
    "description": "The day of Sesame Seeds (Til). Removes poverty and misfortune.",
    "story": "A wealthy woman once gave a handful of clay to a beggar instead of food. She later died and went to heaven but found an empty house with no food. She prayed to the Lord, who told her to observe Shattila Ekadashi. This day emphasizes the importance of charity. 'Shat-tila' means using sesame seeds in six ways, signifying purification and nourishment.",
    "fastingRules": "Six Uses of Til: 1. Bathe in sesame water. 2. Rub sesame paste. 3. Offer sesame in fire. 4. Eat sesame. 5. Give sesame water. 6. Donate sesame seeds. \nDiet: Use sesame in your simple meal (non-grain).",
    "benefits": "Cures poverty and bad luck. Using sesame seeds on this day purifies the body and grants spiritual opulence."
  },
  {
    "id": "3",
    "name": "Jaya Ekadashi",
    "date": "2026-01-29",
    "fastStartTime": "06:41 AM",
    "fastBreakTime": "Jan 30, 06:41 AM - 10:32 AM",
    "description": "Also called Bhaimi Ekadashi. Grants liberation from ghostly existence.",
    "story": "In the celestial gardens of Indra, a Gandharva named Malyavan and his wife Pushpavati were cursed to become Pisachas (ghosts) and suffer in the cold Himalayas. By chance, they fasted completely on Jaya Ekadashi. The power of this observance instantly freed them from their ghostly bodies and restored their celestial forms, proving that Ekadashi burns the heaviest karma.",
    "fastingRules": "Diet: Satvik diet (fruits/roots). Avoid oils and heavy spices. \nFocus: Pray for the liberation of ancestors or those stuck in lower realms of existence.",
    "benefits": "Destroys the karma that leads to lower births (like ghosts or animals). It grants victory over the lower modes of nature."
  },
  {
    "id": "4",
    "name": "Vijaya Ekadashi",
    "date": "2026-02-13",
    "fastStartTime": "06:36 AM",
    "fastBreakTime": "Feb 14, 06:36 AM - 10:29 AM",
    "description": "The day Lord Rama sought victory to cross the ocean.",
    "story": "When Lord Rama reached the shore of the ocean facing Lanka, He sought a way to cross. The sage Bakadalbhya advised Him to observe Vijaya Ekadashi. The Lord performed this vrata with devotion, and soon after, the monkey army successfully built the bridge (Setu) and defeated Ravana. This day grants victory over insurmountable obstacles.",
    "fastingRules": "Worship: Offer worship to Lord Rama. \nDiet: Simple fruits/roots. \nChanting: 'Sri Rama Jaya Rama Jaya Jaya Rama'.",
    "benefits": "Ensures victory in all endeavors, both material and spiritual. It helps one cross the ocean of material suffering."
  },
  {
    "id": "5",
    "name": "Amalaki Ekadashi",
    "date": "2026-02-27",
    "fastStartTime": "06:27 AM",
    "fastBreakTime": "Feb 28, 06:26 AM - 10:23 AM",
    "description": "Worship of the Amla tree. Marks the beginning of Holi festivities.",
    "story": "The Amla (Gooseberry) tree is revered as the resting place of Lord Vishnu. King Chitrasena, a devotee, was once trapped by barbarians in a forest. As they tried to attack him, a divine light emerged from his body (fueled by his observance of Amalaki Ekadashi) and subdued them. This day celebrates the protective power of the Lord found in nature.",
    "fastingRules": "Ritual: Water and worship the Amla tree. Offer Amla fruits to the Lord. \nDiet: Include Amla in your phalahar (non-grain meal).",
    "benefits": "Destroys great sins. Circumambulating the Amla tree on this day grants the merit of donating 1,000 cows."
  },
  {
    "id": "6",
    "name": "Papmochani Ekadashi",
    "date": "2026-03-15",
    "fastStartTime": "06:15 AM",
    "fastBreakTime": "Mar 16, 06:14 AM - 10:14 AM",
    "description": "The remover of all sins and mental conditioning.",
    "story": "The sage Medhavi was seduced by the Apsara Manjughosha and broke his vow of celibacy, living with her for 57 years. When he realized his fall, he was devastated. His father, Sage Chyavana, advised him to observe Papmochani Ekadashi. By this fast, Medhavi was cleansed of his sin and regained his spiritual status.",
    "fastingRules": "Focus: Intense repentance and prayer. \nDiet: Strict fasting is recommended to purify the mind of lust and anger.",
    "benefits": "Neutralizes the most grievous sins. It is the ultimate 'reset' button for a devotee's spiritual life."
  },
  {
    "id": "7",
    "name": "Kamada Ekadashi",
    "date": "2026-03-29",
    "fastStartTime": "06:01 AM",
    "fastBreakTime": "Mar 30, 06:00 AM - 10:05 AM",
    "description": "The fulfiller of all spiritual and material desires.",
    "story": "Lalit, a celestial singer, was cursed to become a cannibalistic demon. His wife, Lalita, observed Kamada Ekadashi and mentally transferred the merit to her husband. Instantly, the demon form vanished, and Lalit regained his celestial body. This story highlights the power of selfless fasting for others.",
    "fastingRules": "Diet: Standard Ekadashi rules. \nIntention: One can dedicate the merit of this fast to a suffering family member.",
    "benefits": "Cures mental distortions and demonic influences. It fulfills the soul's deepest desires."
  },
  {
    "id": "8",
    "name": "Varuthini Ekadashi",
    "date": "2026-04-13",
    "fastStartTime": "05:48 AM",
    "fastBreakTime": "Apr 14, 05:47 AM - 09:56 AM",
    "description": "Grants protection and eternal fortune.",
    "story": "King Mandhata was attacked by a bear in the forest and his leg was chewed off. He prayed to Lord Vishnu, who saved him and advised him to observe Varuthini Ekadashi. Not only did his pain cease, but his limb was miraculously restored, symbolizing how this fast protects the devotee from physical and spiritual danger.",
    "fastingRules": "Specifics: Avoid applying oil to the body. Do not eat from bell-metal plates. Practice non-violence.",
    "benefits": "Grants fearlessness and protection from misfortune. The merit is equal to performing penance for ten thousand years."
  },
  {
    "id": "9",
    "name": "Mohini Ekadashi",
    "date": "2026-04-27",
    "fastStartTime": "05:37 AM",
    "fastBreakTime": "Apr 28, 05:36 AM - 09:48 AM",
    "description": "Cuts the illusion of Maya and material attachment.",
    "story": "Lord Vishnu assumed the form of the enchantress Mohini to recover the nectar of immortality from the demons. Observing this day helps the soul overcome the 'Moh' (delusion) that binds it to the material world, allowing it to taste the nectar of devotion.",
    "fastingRules": "Focus: Meditate on the temporary nature of the world. \nDiet: Eat only once the day before. Strict fast on Ekadashi.",
    "benefits": "Destroys the illusion of 'I' and 'Mine'. It clears the path to spiritual clarity."
  },
  {
    "id": "10",
    "name": "Apara Ekadashi",
    "date": "2026-05-13",
    "fastStartTime": "05:27 AM",
    "fastBreakTime": "May 14, 05:27 AM - 09:42 AM",
    "description": "Grants unlimited ('Apara') merit and wealth.",
    "story": "A King named Mahidhwaja was murdered by his envious brother and became a ghost. A sage observed Apara Ekadashi on his behalf, and the merit was so vast that it instantly liberated the King from his ghostly form and sent him to Vaikuntha.",
    "fastingRules": "Strict: Avoid grains, honey, and sleep during the day. \nActivity: Distribute spiritual books or knowledge.",
    "benefits": "Nullifies heavy offenses like giving false testimony. It grants unlimited spiritual merit."
  },
  {
    "id": "11",
    "name": "Padmini Ekadashi (Adhik)",
    "date": "2026-05-27",
    "fastStartTime": "05:26 AM",
    "fastBreakTime": "May 28, 05:26 AM - 09:42 AM",
    "description": "Rare Adhik Maas Ekadashi. Occurs once every 3 years.",
    "story": "In the Tretayuga, Queen Padmini observed this fast in the extra month (Adhik Maas) to please the Lord. The Lord was so satisfied that He granted her a son, Kartavirya Arjuna, who became the strongest king in the world. This day is very dear to Lord Krishna.",
    "fastingRules": "Special: Chant 'Om Namo Bhagavate Vasudevaya' 108 times. \nDiet: Nirjala (no water) is recommended if possible.",
    "benefits": "The merit is multiplied 1,000 times since it falls in the Purushottama month. It grants pure Bhakti."
  },
  {
    "id": "12",
    "name": "Parama Ekadashi (Adhik)",
    "date": "2026-06-11",
    "fastStartTime": "05:25 AM",
    "fastBreakTime": "Jun 12, 05:25 AM - 09:42 AM",
    "description": "The remover of poverty and suffering in the extra month.",
    "story": "A brahmin named Sumedha lived in extreme poverty. Sage Kaundinya advised him to observe Parama Ekadashi during the Adhik Maas. Upon doing so, the demigods showered him with wealth, and he attained a spiritual destination.",
    "fastingRules": "Diet: Eat only once in the evening (phalahar) or observe complete fast. \nCharity: Donate to worthy brahmanas.",
    "benefits": "Removes the karma of poverty and misery. It grants the rare benediction of personal service to the Lord."
  },
  {
    "id": "13",
    "name": "Nirjala Ekadashi",
    "date": "2026-06-25",
    "fastStartTime": "05:26 AM",
    "fastBreakTime": "Jun 26, 05:26 AM - 09:42 AM",
    "description": "The toughest Ekadashi. Fasting without water.",
    "story": "Bhima, the strongest Pandava, could not tolerate hunger and asked Vyasadeva for a solution. He was advised to observe this single Ekadashi—abstaining even from water for 24 hours. He succeeded, and thus it is called Pandava Nirjala Ekadashi.",
    "fastingRules": "Strict: NO food and NO water from sunrise to sunrise. \nException: Sip water only for purification (achamana).",
    "benefits": "Grants the merit of observing all 24 Ekadashis in the year. It burns stubborn sins and opens the path to Vaikuntha."
  },
  {
    "id": "14",
    "name": "Yogini Ekadashi",
    "date": "2026-07-10",
    "fastStartTime": "05:32 AM",
    "fastBreakTime": "Jul 11, 05:33 AM - 09:45 AM",
    "description": "Cures disease and purifies the body.",
    "story": "The gardener Hemamali was cursed with leprosy for neglecting his duty. He observed Yogini Ekadashi, and the merit of the fast cured his disease instantly, restoring his beautiful form.",
    "fastingRules": "Diet: Simple fruits/roots. Avoid salt. \nFocus: Pray for purification of the body for God's service.",
    "benefits": "Cures skin diseases and physical suffering caused by past karma. It delivers one from the ocean of misery."
  },
  {
    "id": "15",
    "name": "Devshayani Ekadashi",
    "date": "2026-07-25",
    "fastStartTime": "05:40 AM",
    "fastBreakTime": "Jul 26, 05:41 AM - 09:50 AM",
    "description": "Lord Vishnu enters Yoga Nidra. Start of Chaturmas.",
    "story": "On this day, Lord Vishnu goes to rest on the serpent Shesha in the Ocean of Milk for four months. This marks the start of Chaturmas, a period of austerity. Devotees take special vows to minimize sense gratification.",
    "fastingRules": "Vow: Take a Sankalpa for Chaturmas (e.g., giving up a favorite food). \nWorship: Perform Arati to Lord Vishnu before He 'sleeps'.",
    "benefits": "Marks the beginning of spiritual austerity. Observing this ensures the Lord's protection during the rainy season."
  },
  {
    "id": "16",
    "name": "Kamika Ekadashi",
    "date": "2026-08-09",
    "fastStartTime": "05:49 AM",
    "fastBreakTime": "Aug 10, 05:50 AM - 09:55 AM",
    "description": "Forgives the highest sins.",
    "story": "A man who accidentally killed a brahmin was advised to observe Kamika Ekadashi. Worshiping Lord Vishnu with Tulasi leaves on this day is said to burn away even the heaviest sins, more than any amount of gold donation.",
    "fastingRules": "Essential: Offer Tulasi leaves to Lord Vishnu. \nDiet: Fast from grains.",
    "benefits": "Liberates one from the fear of hellish planets. It qualifies the soul for the spiritual sky."
  },
  {
    "id": "17",
    "name": "Shravana Putrada Ekadashi",
    "date": "2026-08-23",
    "fastStartTime": "05:57 AM",
    "fastBreakTime": "Aug 24, 05:58 AM - 10:00 AM",
    "description": "Observed for the well-being of children.",
    "story": "King Mahijit was childless due to a past offense against a cow. By observing this Ekadashi, his past karma was washed away, and he was blessed with a worthy son.",
    "fastingRules": "Prayers: Parents should pray for the spiritual welfare of their children.",
    "benefits": "Removes obstacles in the family line. It ensures the happiness of children and ancestors."
  },
  {
    "id": "18",
    "name": "Aja Ekadashi",
    "date": "2026-09-07",
    "fastStartTime": "06:05 AM",
    "fastBreakTime": "Sep 08, 06:06 AM - 10:02 AM",
    "description": "Restores lost wealth and family.",
    "story": "King Harishchandra lost his kingdom, wife, and child in a test of truth. Working as a crematorium guard, he observed Aja Ekadashi. The merit of the fast restored his dead son to life and returned his kingdom.",
    "fastingRules": "Diet: Simple fruits/water. \nFocus: Practice truthfulness.",
    "benefits": "Restores lost fortune and reputation. It gives strength to endure the hardest tests of life."
  },
  {
    "id": "19",
    "name": "Parivartini Ekadashi",
    "date": "2026-09-22",
    "fastStartTime": "06:12 AM",
    "fastBreakTime": "Sep 23, 06:13 AM - 10:05 AM",
    "description": "Lord Vishnu turns on His side (Parsva).",
    "story": "During His cosmic sleep, Lord Vishnu turns from left to right. This day is also linked to the Vamana Avatar, who took three steps of land from King Bali. Bali surrendered his head for the third step, exemplifying total surrender.",
    "fastingRules": "Worship: Vamana Avatar. \nFocus: Surrender your ego to the Lord.",
    "benefits": "Cleanses sins and brings the devotee closer to complete surrender to God."
  },
  {
    "id": "20",
    "name": "Indira Ekadashi",
    "date": "2026-10-06",
    "fastStartTime": "06:19 AM",
    "fastBreakTime": "Oct 07, 06:20 AM - 10:05 AM",
    "description": "Liberation for ancestors (Pitru).",
    "story": "King Indradyumna observed this fast to liberate his father, who was suffering in Yamaloka. As soon as the fast was completed, flowers rained from the sky, and his father ascended to Vaikuntha.",
    "fastingRules": "Special: Offer prayers/charity for ancestors. \nDiet: Eat only once the day before.",
    "benefits": "Delivers forefathers from hellish conditions. It is the greatest charity for the departed."
  },
  {
    "id": "21",
    "name": "Papankusha Ekadashi",
    "date": "2026-10-22",
    "fastStartTime": "06:28 AM",
    "fastBreakTime": "Oct 23, 06:29 AM - 10:08 AM",
    "description": "The goad that controls the elephant of sin.",
    "story": "A cruel hunter who had never done a pious deed was saved from hell because he unknowingly observed this Ekadashi. The merit burned his heavy karma to ashes.",
    "fastingRules": "Diet: Strict fast. \nFocus: Control the mind and senses.",
    "benefits": "Guarantees that one will not see the face of Yamaraja (Death) at the end of life."
  },
  {
    "id": "22",
    "name": "Rama Ekadashi",
    "date": "2026-11-05",
    "fastStartTime": "06:37 AM",
    "fastBreakTime": "Nov 06, 06:38 AM - 10:12 AM",
    "description": "Named after Goddess Lakshmi (Rama).",
    "story": "Princess Chandrabhaga's husband Shobhana died observing this fast but attained a celestial kingdom. She later joined him and made his kingdom eternal with her own merit.",
    "fastingRules": "Worship: Lord Damodara and Lakshmi Devi. \nActivity: Offer lamps (Deep-daan).",
    "benefits": "Grants both material enjoyment and ultimate liberation. Pleases Goddess Lakshmi."
  },
  {
    "id": "23",
    "name": "Devutthana Ekadashi",
    "date": "2026-11-20",
    "fastStartTime": "06:48 AM",
    "fastBreakTime": "Nov 21, 06:49 AM - 10:18 AM",
    "description": "Lord Vishnu wakes up. End of Chaturmas.",
    "story": "Lord Vishnu wakes up from His four-month sleep. Devotees celebrate by performing the marriage of Tulasi Devi and Saligram (Krishna), signifying the union of the soul with God.",
    "fastingRules": "Ritual: Tulasi-Vivah. \nFocus: Break Chaturmas vows.",
    "benefits": "Completes the vows of Chaturmas. Qualifies the devotee for intimate service."
  },
  {
    "id": "24",
    "name": "Utpanna Ekadashi",
    "date": "2026-12-04",
    "fastStartTime": "06:58 AM",
    "fastBreakTime": "Dec 05, 06:59 AM - 10:24 AM",
    "description": "The appearance of Ekadashi Devi.",
    "story": "Ekadashi Devi appeared from Lord Vishnu's body to kill the demon Mura. Pleased, the Lord granted her the power to destroy sins.",
    "fastingRules": "Significance: Ideal for beginners. \nPrayer: Pray for strength to control senses.",
    "benefits": "The genesis of all Ekadashi blessings. Pleases the Lord immensely."
  },
  {
    "id": "25",
    "name": "Mokshada Ekadashi",
    "date": "2026-12-20",
    "fastStartTime": "07:07 AM",
    "fastBreakTime": "Dec 21, 07:08 AM - 10:30 AM",
    "description": "Gita Jayanti. Liberation from birth and death.",
    "story": "The day Krishna spoke the Gita. A King liberated his father from hell by observing this fast. It proves that the Gita and Ekadashi lead to the same goal.",
    "fastingRules": "Activity: Read Bhagavad Gita. \nDiet: Fast from grains.",
    "benefits": "Grants liberation to ancestors and the observer. Clarifies spiritual doubts."
  }
]